model {
  faster_rcnn {
    num_classes: 1
    image_resizer {
      fixed_shape_resizer {
        height: 4032
        width: 3024
        resize_method: AREA
      }
    }
    feature_extractor {
      type: "faster_rcnn_inception_v2"
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        height_stride: 16
        width_stride: 16
        scales: 0.25
        scales: 0.5
        scales: 1.0
        scales: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 1.0
        aspect_ratios: 2.0
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 500
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 500
        max_total_detections: 500
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}
train_config {
  batch_size: 5
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  optimizer {
    adam_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.0002
          schedule {
            step: 900000
            learning_rate: 2e-05
          }
          schedule {
            step: 1200000
            learning_rate: 2e-06
          }
        }
      }
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/mnt/scratch/mengfanr/Projects/Friut_count/train_second/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 6000
}
train_input_reader {
  label_map_path: "/mnt/scratch/mengfanr/Projects/Friut_count/train_second/mscoco_label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/mnt/scratch/mengfanr/Projects/Friut_count/train_second/train_properties_80_images_add_Br_0.4.record"
  }
}
eval_config {
  num_examples: 100
  max_evals: 1
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "/mnt/home/mengfanr/Arabidopsis_seeds_detect/faster_rcnn_fruits/mscoco_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "/mnt/home/mengfanr/Arabidopsis_seeds_detect/faster_rcnn_fruits/eval.record"
  }
}
